In [1]:
import pandas as pd
df = pd.read_csv("Motorola.csv")

In [2]:
df.head()

   Year   Company  Revenue (in millions)  Profit (in millions)
0  1955  Motorola                  205.2                   7.6
1  1956  Motorola                  226.7                   8.5
2  1957  Motorola                  227.6                   8.0
3  1958  Motorola                  226.4                   7.8
4  1959  Motorola                  216.6                   7.4

In [6]:
students = {"Data Analytics": 
["Patrizia",
"Rabeea",
"Bibian"], 
"Business": [
{"Brian": [
            "Intro to business",
            "Law and Ethics"
        ]}
    ]
        }

In [11]:
students["Business"][0]["Brian"]

['Intro to business', 'Law and Ethics']

## MySQL

In [12]:
#!pip install mysql-connector-python

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: mysql-connector-python in c:\users\sam\appdata\roaming\python\python39\site-packages (8.0.31)
Requirement already satisfied: protobuf<=3.20.1,>=3.11.0 in c:\users\sam\appdata\roaming\python\python39\site-packages (from mysql-connector-python) (3.20.1)

In [13]:
import mysql.connector

In [19]:
host="localhost" # "127.0.0.1"
user="pda2023" # root
password="pda2023" # root password

In [16]:
db = mysql.connector.connect(
    host=host,
    user=user,
    password=password,
    #port=3306
)
print(db)

<mysql.connector.connection.MySQLConnection object at 0x000001EE00167520>

In [17]:
conn = db.cursor()

In [18]:
conn = db.cursor()
conn.execute("CREATE DATABASE students;")
conn.execute("SHOW DATABASES;")

In [20]:
conn.execute("SHOW DATABASES;")

In [21]:
for result in conn:
    print(result)

('bank',)
('companies',)
('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('students',)
('sys',)
('testdb',)
('trades',)
('world',)
('world_cup',)

In [22]:
conn.execute("USE students;")

In [23]:
conn.close()

True

In [24]:
db = mysql.connector.connect(
    host=host,
    user=user,
    password=password,
    #port=3306,
    database="students"
)
conn = db.cursor()

In [26]:
#conn.execute("CREATE DATABASE students;")
conn.execute("CREATE DATABASE IF NOT EXISTS students;")

In [29]:
conn.execute("CREATE TABLE IF NOT EXISTS test (id INT);")

In [30]:
conn.execute("CREATE TABLE IF NOT EXISTS students (name VARCHAR(255), age INT, studentNum INT PRIMARY KEY);")

In [38]:
conn.execute("SHOW TABLES;")
for result in conn:
    print(result)

In [39]:
conn.execute("INSERT INTO students (name, age, studentNum) VALUES ('Sam', 49, 123)")

In [42]:
conn.execute("INSERT INTO students (name, age, studentNum) VALUES ('Sam', 49, 124)")

In [44]:
conn.execute("SELECT * FROM students;")
for result in conn:
    print(result)

('Sam', 49, 123)
('Sam', 49, 124)

In [51]:
conn.execute("SELECT * FROM students WHERE studentNum=123;")
for result in conn:
    print(result)

('Sam', 49, 123)

In [56]:
conn.execute("SELECT name FROM students WHERE studentNum=123;")
for result in conn:
    print(result)

('Sam',)

In [54]:
db.commit()

In [57]:
conn.execute("UPDATE students SET name='Joe' WHERE studentNum=124;")

In [64]:
conn.execute("SELECT * FROM students;")
for result in conn:
    print(result)

('Sam', 49, 123)
('Joe', 49, 124)

In [61]:
db.commit()

In [65]:
conn.close()

True

# Exercise 1

Create a new table called programmes

The columns are the programme name (primary key), as well as up to 6 modules

Insert the MSc Data Analytics with the modules for this semester

# Exercise 2

Read one of the company csv files

Store it in a table in a **new** database